decare/horizon/testing/getClaimSOP/Request_1/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.service.member.portal.dds.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:getClaimSOP>
         <ClientName>?</ClientName>
         <UserName>?</UserName>
         <ClientTransactionId>?</ClientTransactionId>
         <SourceSystem>DECARE</SourceSystem>
         <!--Optional:-->
         <ClientSubmitDateTime>?</ClientSubmitDateTime>
         <!--Optional:-->
         <ClientSessionId>?</ClientSessionId>
         <!--Optional:-->
         <Timeout>60</Timeout>
         <SearchCriteria>
            <MaxRowsToReturn>100</MaxRowsToReturn>
            <!--Optional:-->
            <ProviderParStatus></ProviderParStatus>
            <!--Optional:-->
            <ProviderId></ProviderId>
            <!--Optional:-->
            <ProviderNPI></ProviderNPI>
            <SubscriberId>3HZN86819480</SubscriberId>
            <!--Optional:-->
            <ClaimPatientFirstName></ClaimPatientFirstName>
            <!--Optional:-->
            <ClaimPatientLastName></ClaimPatientLastName>
            <!--Optional:-->
            <ClaimPatientPatientDOB></ClaimPatientPatientDOB>
            <!--Optional:-->
            <ClaimDosStartDate></ClaimDosStartDate>
            <!--Optional:-->
            <ClaimDosEndDate></ClaimDosEndDate>
            <!--Optional:-->
            <ClaimId></ClaimId>
            <!--Optional:-->
            <ClaimStatusCode></ClaimStatusCode>
            <!--Optional:-->
            <ClaimCheckNo></ClaimCheckNo>
            <!--Optional:-->
            <ClaimEFTTraceNo></ClaimEFTTraceNo>
            <!--Optional:-->
            <ClaimPaymentPayeeType></ClaimPaymentPayeeType>
            <!--Optional:-->
            <IncludePIDSearch>true</IncludePIDSearch>
            <!--Optional:-->
            <IncludeClaimHistory>true</IncludeClaimHistory>
            <!--Optional:-->
            <IncludeClaimProviderAddress>true</IncludeClaimProviderAddress>
            <!--Optional:-->
            <IncludeClaimMessageText>true</IncludeClaimMessageText>
            <!--Optional:-->
            <IncludeClaimPatientDetail>true</IncludeClaimPatientDetail>
            <!--Optional:-->
            <IncludeSubsGroup>true</IncludeSubsGroup>
            <!--Optional:-->
            <IncludeClaimPayment>true</IncludeClaimPayment>
            <!--Optional:-->
            <IncludeAggregateAmountFromLines>true</IncludeAggregateAmountFromLines>
         </SearchCriteria>
      </ws:getClaimSOP>
   </soapenv:Body>
</soapenv:Envelope>
